## Skapa gles matris

In [1]:
import pandas as pd

with open ('./ml-25m/ratings.csv') as ratings:
    df_ratings = pd.read_csv(ratings)

df_ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [2]:
df_ratings.drop('timestamp', axis = 1, inplace = True)
df_ratings.head()

   userId  movieId  rating
0       1      296     5.0
1       1      306     3.5
2       1      307     5.0
3       1      665     5.0
4       1      899     3.5

In [3]:
ratings_count = df_ratings.userId.value_counts()
counts_df = ratings_count.rename_axis('userId').reset_index(name='counts') # Get right columns userId and count
counts_df_too_many = counts_df[counts_df['counts'] > 1000] # filter df where count > 1000


print(sum(counts_df_too_many['counts'])) #Removed ratings

counts_df.drop(counts_df[counts_df['userId'].isin(counts_df_too_many['userId'])].index, axis = 0, inplace= True) # Get user ids, Drop users on main dataframe

counts_df

4187357

        userId  counts
2670    140790    1000
2671     37097    1000
2672       860    1000
2673      9742    1000
2674    158351    1000
...        ...     ...
162536   12094      20
162537  119539      20
162538  156759      20
162539   12084      20
162540   36207      20

[159871 rows x 2 columns]

Remove users that may be robots or too far away from mean ?

In [4]:
df_ratings.drop(df_ratings[~df_ratings['userId'].isin(counts_df['userId'])].index, axis = 0, inplace = True) #Drops users with 1000 + reviews (not in counts_df)
df_ratings

          userId  movieId  rating
0              1      296     5.0
1              1      306     3.5
2              1      307     5.0
3              1      665     5.0
4              1      899     3.5
...          ...      ...     ...
25000090  162541    50872     4.5
25000091  162541    55768     2.5
25000092  162541    56176     2.0
25000093  162541    58559     4.0
25000094  162541    63876     5.0

[20812738 rows x 3 columns]

In [6]:
#movies_users = df_ratings.pivot(index ="movieId", columns = "userId", values ="rating").fillna(0)
df_ratings.shape

(20812738, 3)

In [7]:
BYTES_TO_MB_DIV = 0.000001
def print_memory_usage_of_data_frame(df):
    mem = round(df.memory_usage().sum() * BYTES_TO_MB_DIV, 3) 
    print("Memory usage is " + str(mem) + " MB")
    
print_memory_usage_of_data_frame(df_ratings)

Memory usage is 666.008 MB